app/controllers/phones_controller.rb

  def index
    @phones = Phone.all
---
SELECT "phones".* FROM "phones"

  def destroy
    @phone.destroy
---
DELETE FROM "phones" WHERE "phones"."id" = $1  [["id", 1]]

  def set_phone
    @phone = Phone.find(params[:id])
---
SELECT  "phones".* FROM "phones"  WHERE "phones"."id" = $1 LIMIT 1  [["id", 2]]